blog/2021/bold-in-org-mode.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 11:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Bold in Org-mode</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">Bold in Org-mode</h1>
</header><p>
<b>精神</b> 是人在思考时表现出来的意志和持久的追求。 <b>态度</b> 是人在思考时表现出来的当下的意愿和倾向。将当下的意愿和持久的追求结合起来，就会形成诸如理性的谦逊、执著、公正、勇敢、诚实、勤奋等好的 <b>理性美德。</b>
</p>

<p>
<b>迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭代器会暴露迭代其关联可迭代对象的 API。迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。</b>
</p>

<p>
迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭代器会暴露迭代其关联可迭代对象的 API。
<b>迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。</b>
</p>

<p>
迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭代器会暴露迭代其关联可迭代对象的 API。 <b>迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。</b>
</p>

<p>
迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭
<b>代器会暴露迭代其关联可迭代对象的 API。迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。</b>
</p>

<p>
<b>Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C++ or C with a focus on code safety and concise syntax.</b>
</p>

<p>
Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C++ or C <b>with a focus on code safety and concise syntax.</b>
</p>

<p>
Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C++ or C <b>with a focus on code safety and concise syntax</b>.
</p>

<p>
<b>Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C</b>
++ or C with a focus on code safety and concise syntax.
</p>

<p>
原来的文本：
</p>

<pre class="example">
*精神* 是人在思考时表现出来的意志和持久的追求。 *态度* 是人在思考时表现出来的当下的意愿和倾向。将当下的意愿和持久的追求结合起来，就会形成诸如理性的谦逊、执著、公正、勇敢、诚实、勤奋等好的 *理性美德。*

*迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭代器会暴露迭代其关联可迭代对象的 API。迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。*

迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭代器会暴露迭代其关联可迭代对象的 API。
*迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。*

迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭代器会暴露迭代其关联可迭代对象的 API。 *迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。*

迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭
*代器会暴露迭代其关联可迭代对象的 API。迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。*

*Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C++ or C with a focus on code safety and concise syntax.*

Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C++ or C *with a focus on code safety and concise syntax.*

Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C++ or C *with a focus on code safety and concise syntax*.

*Rust helps developers write fast software that's memory-efficient. It's a modern replacement for languages like C*
++ or C with a focus on code safety and concise syntax.
</pre>

<p>
由以上测试可得出结论：
</p>

<ol class="org-ol">
<li>对于英文文本，加粗前要确保目标文本前后存在空格或空行</li>
<li>对于中文文本，加粗前要确保目标文本前后存在空格或空行</li>
<li>对于中文文本，加粗要包含标点</li>
</ol>

<blockquote>
<p>
While in Org, by default at least, emphasis markers have to be delimited by whitespace or punctuation.<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</blockquote>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://emacs.stackexchange.com/a/42188/30800">https://emacs.stackexchange.com/a/42188/30800</a></p></div></div>


</div>
</div></div>
</body>
</html>